src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/CommonModules/ОбщегоНазначенияВызовСервераПовтИсп/Module.bsl
#Область Разное
	
Функция ПроцентСтавкиНДС(СтавкаНДС) Экспорт
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда 
		Возврат СтавкаНДС.Ставка;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

// Реквизиты вида цен для подстановки цены (кэшируются на время сеанса).
//
// Параметры:
//  ВидЦены - СправочникСсылка.ВидыЦен
//
// Возвращаемое значение:
//  Структура - ДинамическийРасчет, ОсноваРасчёта, ВидНаценки, Показатель, Точность, ЦенаВключаетНДС;
//              для пустого вида цен ДинамическийРасчет = Ложь, ЦенаВключаетНДС = Истина.
//
Функция ДанныеВидаЦены(ВидЦены) Экспорт
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидЦены,
		"ДинамическийРасчет, ОсноваРасчёта, ВидНаценки, Показатель, Точность, ЦенаВключаетНДС");
	Данные.ДинамическийРасчет = (Данные.ДинамическийРасчет = Истина);
	Данные.ЦенаВключаетНДС = (Данные.ЦенаВключаетНДС = Истина Или Не ЗначениеЗаполнено(ВидЦены));
	Возврат Данные;
КонецФункции

#КонецОбласти

#Область Хозяйственные_операции

Функция ЭтоРасчётыСПокупателями(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	&ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента),  
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.АвансКлиента),  
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПродажаВКредит), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеЗадолженности), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.Сертификат), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента)) КАК Результат");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить()[0].Результат;
КонецФункции

Функция ЭтоРасчётыСПоставщиками(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	&ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеЗадолженности), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.Сертификат), 
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)) КАК Результат");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить()[0].Результат;
КонецФункции

Функция ЭтоПрочееДДС(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	&ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств),
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочийРасходДенежныхСредств)) КАК Результат");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить()[0].Результат;
КонецФункции

Функция ЭтоРасчётыСКонтрагентамиПрочие(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	&ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОперационныеЗатраты)) КАК Результат");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить()[0].Результат;
КонецФункции

Функция ЭтоРасчётыСФизическимиЛицами(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	&ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты)) КАК Результат");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить()[0].Результат;
КонецФункции

Функция ЭтоРасчётыССобственнымиОрганизациями(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	&ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассу),
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассы),
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.Инкассация),
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаБанковскийСчет),
						  |							  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствСБанковскогоСчета)) КАК Результат");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить()[0].Результат;
КонецФункции

Функция ЭтоУбыток(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НЕ &ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику), 
						  |								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту), 
						  |								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств), 
						  |								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассу), 
						  |							  	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочийРасходДенежныхСредств)) КАК Результат");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить()[0].Результат;
КонецФункции

Функция ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ХозяйственнаяОперация) Экспорт
	ХО = Перечисления.ХозяйственныеОперации;
	Соответствие = Новый Соответствие;
	// Клиенты
	Соответствие.Вставить(ХО.ПоступлениеОплатыОтКлиента, ХО.ВозвратОплатыКлиенту);
	Соответствие.Вставить(ХО.ВозвратОплатыКлиенту, ХО.ПоступлениеОплатыОтКлиента);
	// Поставщики
	Соответствие.Вставить(ХО.ОплатаПоставщику, ХО.ВозвратДенежныхСредствОтПоставщика);
	Соответствие.Вставить(ХО.ВозвратДенежныхСредствОтПоставщика, ХО.ОплатаПоставщику);
	// Банковские счета
	Соответствие.Вставить(ХО.ПеречислениеДенежныхСредствНаБанковскийСчет, ХО.ПоступлениеДенежныхСредствСБанковскогоСчета);
	Соответствие.Вставить(ХО.ПоступлениеДенежныхСредствСБанковскогоСчета, ХО.ПеречислениеДенежныхСредствНаБанковскийСчет);
	// Кассы
	Соответствие.Вставить(ХО.ВыдачаДенежныхСредствВКассу, ХО.ПоступлениеДенежныхСредствИзКассы);
	Соответствие.Вставить(ХО.ПоступлениеДенежныхСредствИзКассы, ХО.ВыдачаДенежныхСредствВКассу);
	//
	НайденнаяХозяйственнаяОперация = Соответствие.Получить(ХозяйственнаяОперация);
	Возврат ?(НайденнаяХозяйственнаяОперация = Неопределено, ХозяйственнаяОперация, НайденнаяХозяйственнаяОперация);
КонецФункции

#КонецОбласти
